const rule = {
  id: {
    pattern: /^\d{0,20}$/,
    message: '只能是数字'
  },
  ids: {
    pattern: /^\d{0,20}(,\d{0,20})*$/,
    message: '输入的格式有误'
  },
  name: {
    max: 20,
    message: '最多不超过20个字'
  },
  email: {
    pattern: /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/i,
    message: '请输入正确的邮箱格式'
  },
  url: {
    pattern: /^(?:\w+:)?\/\/([^\s.]+\.\S{2}|localhost[:?\d]*)\S*$/i,
    message: '请输入正确的网址'
  },
  cellphone: {
    pattern: /(^(13\d|14[57]|15[^4,\D]|17\d|18\d)\d{8}|170[059]\d{7})$/,
    message: '请输入正确的手机号码'
  },
  telephone: {
    pattern: /^((0\d{2,3})-)(\d{7,8})(-(\d{3,}))?$/,
    message: '请输入正确的电话号码'
  },
  int: {
    pattern: /^([0-9]*[1-9][0-9]*|0)$/,
    message: '请输入正确的整数'
  },
  percent: {
    pattern: /^(\d|[1-9]\d|100(\.0{1,2})?)(\.\d{1,2})?$/,
    message: '请输入正确的百分比'
  },
  idCard: {
    pattern: /^((\d{18})|([0-9x]{18})|([0-9X]{18}))$/,
    message: '请输入正确的身份证号'
  },
  zipCode: {
    // 中国邮编
    pattern: /^[1-9]\d{5}(?!\d)$/,
    message: '请输入正确的邮编'
  },
  ip: {
    // IP地址
    pattern: /^((?:(?:25[0-5]|2[0-4]\d|((1\d{2})|([1-9]?\d)))\.){3}(?:25[0-5]|2[0-4]\d|((1\d{2})|([1-9]?\d))))$/,
    message: '请输入正确的IP地址'
  }
};

export default rule;
